select * from food;

/*
	insert into food values(, '', '', '', '');
*/
insert into food values(172, '한라봉', '172.png', null, null);
insert into food values(174, '레몬', '174.png', null, null);
insert into food values(39, '블루베리', '39.png', null, null);
insert into food values(178, '당근', '178.png', null, null);
insert into food values(20, '토마토', '20.png', null, null);

insert into food values(200, '자몽', '200.png', '자몽은 서인도제도의 바베이도스가 원산지인 과일로 그레이프프루트가 표준어 입니다.', '자몽에 함유되어 있는 성분중 이노시톨 성분은 항 지방간 비타민 이라고도 불리우는데 지방의 흐름을 원활하게 하여 간에 지방이 쌓이는것을 막아주어 간 기능을 높여 줍니다. 
자몽에 풍부한 엽산은 혈액이나 세포를 만드는 기능을 합니다. 또 태아의 뇌와 척수등을 형성하는데 도움이 되는 성분이라고 합니다. 
따라서 임산부에 매우 도움이 되는 과일이라고 하며 미국에서는 임산부에게 자몽을 적극 추천한다고 합니다.
자몽 반개로 시금치 3 다발 분의 엽산을 섭취 할 수 있다고 합니다. 
수용성 식이섬유인 펙틴이 풍부하게 함유되어 있으며 펙틴은 혈중 콜레스테롤 수치를 낮추는 효과가 있다고 합니다.
자몽에 함유되어 있는 성분중 이노시톨 성분은 항 지방간 비타민 이라고도 불리우는데 지방의 흐름을 원활하게 하여 간에 지방이 쌓이는것을 막아주어 간 기능을 높여 줍니다. 
자몽에 풍부한 엽산은 혈액이나 세포를 만드는 기능을 합니다. 또 태아의 뇌와 척수등을 형성하는데 도움이 되는 성분이라고 합니다.
따라서 임산부에 매우 도움이 되는 과일이라고 하며 미국에서는 임산부에게 자몽을 적극 추천한다고 합니다.
자몽 반개로 시금치 3 다발 분의 엽산을 섭취 할 수 있다고 합니다. 수용성 식이섬유인 펙틴이 풍부하게 함유되어 있으며 펙틴은 혈중 콜레스테롤 수치를 낮추는 효과가 있다고 합니다.
자몽 과육의 붉은색소인 라이코펜과 풍부한 비타민 으로 인해 항산화효과가 뛰어나다고 합니다.
자몽에는 자외선으로 부터 피부를 보호하고 세포가 죽는것을 예방하는 바이오플라보노이드 성분도 함유 하고 있어서 항산화 효과 뿐만 아니라 피부미용에도 도움이 된다고 합니다.
자몽의 풍부한 비타민C는 콜라겐 생성을 촉진시켜 피부 재생을 원활하게 하며 피부 트러블과 피부 노화 등을 예방해 탱탱한 피부를 유지할 수 있도록 도와줍니다.
인슐린 분비를 억제해주는 효과가 있어서 당뇨개선에 도움이 된다고 합니다.
자몽에 풍부한 칼륨이 심장이나 근육의 정상적인 수축을 돕고 당대사를 촉진하는 기능이 있습니다.
또 자몽에 풍부하게 함유되어 있는 비타민C는 혈관을 강하게 만들어주는 효과가 있어서 심장건강에 도움이 된다고 합니다.
자몽의 쓴맛을 내는 성분인 리모닌 성분은 암 예방효과가 있는것으로 알려져 있습니다.
리모닌을 지속적으로 섭취하게 되면 체내의 해독 대사 효소를 활성화 하며 체내의 발암 물질을 배출하는 효과가 있어 암 예방에 도움이 된다고 합니다.
리코펜 성분이 많이 함유되어 있는데요.
리코펜은 카로틴의 일종으로, 카로틴을 섭취하게 되면 체내에서 비타민A로 바뀌게 된다고 합니다.
비타민A는 피부나 눈의 점막을 강화하는 기능이 있어 눈건강에 도움을 기대할 수 있습니다.
콜레스테롤을 낮춰주는 고지혈 치료제와 자몽을 함께 섭취하면 그 효과를 지나치게 높여 부작용을 일으킬 수 있습니다.');

insert into food values(201, '달걀', '201.png','달걀(계란)은 영양 덩어리입니다.
계란 흰자의 영양 성분은 주로 단백질이며, 계란 노른자는 단백질 외에 레시틴, 비타민 A·B2·D·E, 철분, 칼슘 등이 풍부하게 포함되어 있습니다.
또한 계란의 지방은 체내에서 잘 분해되기 때문에 소화 흡수가 잘되며, 계란의 단백질은 다른 단백질의 흡수율을 높이는 성질이 있습니다.
단백질을 구성하는 20여 종류의 아미노산 중 우리 몸에 필수적인 8 종류의 아미노산을 필수 아미노산이라고 합니다.
이 8종의 필수 아미노산이 달걀에는 균형있게 포함되어 있습니다.' , '숙면에 도움, 달걀같은 고단백질 음식은 잠을 부추기고 위산역류를 달래줍니다.
아침 공복에 식사대용으로 달걀을 섭취하면, 하루동안 섭취하는 칼로리를 줄여주는 효과가 있다고 한다.
달걀 노른자에는 비타민B군의 하나로 피부,손발톱,머리카락을 매끄럽게 만들고 신경계/골수의 기능을 원활하게 해주는 "비오틴"성분이 함유되어 있습니다.
그러나 공교롭게도 달걀의 흰자에 "아비딘"이라는 성분이 흰자에 함유되어 있어 "비오틴"성분의 체내흡수를 방해합니다.
그러므로 되도록이면 달걀의 흰자는 완숙으로 완적히 익혀드시는 것이 좋습니다.');

insert into food values(179, '브로콜리', '179.png', null, null);
insert into food values(8, '시금치', '8.png', null, null);
insert into food values(76, '땅콩', '76.png', null, null);
insert into food values(202, '아몬드', '202.png', '아몬드에는 다량의 단일불포화지방산과 단백질이 풍부하게 들어 있습니다.', '항산화 성분이 풍부합니다.
항산화 성분은 우리 몸에서 활성산소가 일으키는 세포 변종과 세포 노화에 대응하고 각종 질병을 억제합니다.
이 성분은 주로 아몬드의 갈색 껍질에 들어 있어서, 껍질을 벗긴 아몬드에서는 이 효능을 기대할 수 없습니다.
특히 항산화제로 작용하는 비타민E는 아몬드 100g에 25.63mg이 들어 있어서, 비타민E의 가장 풍부한 공급원 중 하나입니다.

섬유질이 풍부합니다.
아몬드 100g에 12.5g의 섬유질이 들어 있습니다.
섬유질은 탄수화물의 흡수를 느리게 해서 혈당 조절을 돕고, 또한 소화를 돕습니다.

미네랄이 풍부합니다.
모든 생물에 필수 미네랄인 마그네슘이 풍부하게 들어 있고, 뼈 건강에 중요한 인과, 면역 기능과 소화기능 등에 작용하는 망간도 풍부하게 들어 있으며, 헤모글로빈의 성분인 철분도 풍부하게 들어 있습니다.
우리 몸에 이로운 많은 영양소가 갈색 속껍질에 들어 있으므로 구매할때 되도록이면 갈색 속껍질이 있는 아몬드를 선택하세요.

냄새를 맡아서 기름 냄새가 난다면 너무 오래돼서 산패한 것이므로 피해야 합니다.
밀폐 용기에 담아 서늘하고 건조한 곳에 보관.');

insert into food values(203, '검은콩', '203.png', '낟알 껍질의 빛깔이 검은빛을 띄는 콩으로 흑태, 서목태(쥐눈이콩), 서리태 등이 있다.', '흑태는 콩밥, 콩자반 등으로
서리태는 콩밥, 콩떡 등으로
서목태는 한방에서 약콩으로 주로 쓰인다.

일반콩에 비해
콜레스테롤 수치를 낮춰주는 기능이 높고 안토시아닌이 풍부해 강력한 항산화작용을 한다고 한다.

[부작용]
- 과다섭취시 여성호르몬이 과잉분비될 수 있다.
- 소화가 잘 되지 않으므로 소화력이 약한사람은 부드럽게 익혀먹어야 한다.
- 적당량의 섭취는 신장기능을 활성화 시키지만, 이미 신장이 좋지않은 사람은 주의해야 한다.');

insert into food values(204, '치즈', '204.png', '치즈 또는 건락은 우유, 산양유, 양젖 또는 그 밖의 파충류의 젖으로 만든 고체 음식이다.
칼슘, 단백질, 지방 등의 영양성분이 풍부하게 들어있다.', '스트레스 해소.
시력보호, 빈혈예방, 피로회복.
당뇨병 예방.
숙면에 도움, 고단백질 음식은 잠을 부추기고 위산역류도 달래준다.
치즈에는 염분과 지방의 함량이 높기 때문에 염분 섭취를 제한해야 하는 사람,
비만 또는 다이어트를 하고 있을때에는 치즈를 제한 하는 것이 바람직합니다.');

insert into food values(170, '딸기', '170.png', null, null);

insert into food values(205, '아보카도', '205.png', '아보카도는 멕시코가 원산지로 악어의 등처럼 울퉁불퉁하다고 해서 악어배라고 불립니다.', 
'혈관벽을 튼튼하게 하고 혈액을 흐름 개선.
아보카도에 포함되어 있는 식물 영양소 중에서 항산화 작용이 있는 카로티노이드 성분은 체내의 혈관벽을 튼튼하게 해주는 효과가 있습니다.
그리고 높은 비율의 불포화 지방산은 혈액 흐름을 개선시켜 주는 효과가 있어서 저혈압과 고혈압 환자에게 모두 좋은 효과를 기대할 수 있습니다.
좋은 콜레스테롤 증가.
아보카도 속의 불포화 지방산 성분인 올레산과 팔미트산등은 좋은 콜레스테롤을 증가 시켜 건강한 혈액을 만들고 관상동맥 질환에 도움을 줍니다.
변비와 혈중 콜레스테롤 수치를 개선.
아보카도 100g 속에는 하루 필요 섭취량의 18%에 해당하는 풍부한 식이섬유가 들어있어서 변비와 혈중 콜레스테롤 수치를 낮추는데 도움을 줍니다.
항산화 작용과 면역력 개선.
아보카도의 폴리페놀(루테인, 제산악틴, 베타·알파카로틴)과 플로보노이드 화합물은 항염증·항궤양 작용은 물론, 노화와 각종 질병을 일으키는 활성산소를 억제하는데 도움을 줍니다.
용에 효과.
아보카도에는 비타빈A·E·K 그리고 철·구리·마그네슘 등 풍부한 미네랄의 보고입니다.
특히 토코페롤이라고 불리는 비타민E성분은 노화를 방지하는 효과가 기대되는 성분입니다.
[부작용/주의사항]
아보카도에는 심혈관 질환에 좋은 불포화 지방산이 많이 들어있지만 불포화 지방산도 역시 지방이기 때문에 칼로리를 많이 낼 수 밖에 없습니다.
그러므로 다이어트 등 체중 조절이 필요한 사람들은 과잉 섭취 않도록 주의해야 합니다. 그리고 탄닌 성분이 많아 탄닌에 의한 특정 미네랄 성분의 채내 흡수를 억제 시킬 수 있습니다.
꽃가루에 알레르기를 일으키는 사람은 먹고난 후에 입이나 인후부에 알레르기 증상이 나타나고,
라텍스에 알레르기를 일으키는 사람들은 전신의 두드러기, 복통, 구토를 일으키고 때로는 그 반응이 심각해서 생명을 위협할 수도 있다고 합니다.');

insert into food values(127, '오이', '127.png', null, null);

insert into food values(206, '계피', '206.png', '동의보감에 의하면
속을 따뜻하게 하고 혈맥을 잘 통하게 하고 간이나 폐의 기를 고르게 한다고 한다.', '자양강장.
해열, 진통 효과.
항균, 살충효과.
충치예방.
곰팡이 없애는 효과.
몸에 열이 많은사람은 주의하는게 좋다.');


-- food 테이블의 한 줄을 지우고 싶을 때 
DELETE FROM food WHERE num = 172;

-- food 테이블 insert한거 몽땅 없애고 싶을 때 
set FOREIGN_KEY_CHECKS = 0;
truncate food;
set FOREIGN_KEY_CHECKS = 1;