SELECT * FROM semidb.review;

insert into review values(null, "a", 5300, ('2020-02-24 09:12:31'), 0, "고혈압 치료 방법", "고혈압 치료를 하려면 나트륨을 적게 먹어야한다.", null, null, "한라봉");
insert into review values(null, "a", 5300, ('2020-03-09 09:12:31'), 0, "고혈압 치료 방법", "고혈압 치료를 하려면 나트륨을 적게 먹어야한다.", null, null, "한라봉");
insert into review values(null, "a", 5300, ('2020-03-29 09:12:31'), 0, "고혈압 치료 방법", "고혈압 치료를 하려면 나트륨을 적게 먹어야한다.", null, null, "한라봉");
insert into review values(null, "a", 5300, ('2021-02-24 09:12:31'), 0, "고혈압 치료 방법", "고혈압 치료를 하려면 나트륨을 적게 먹어야한다.", null, null, "한라봉");
insert into review values(null, "a", 5300, ('2021-05-24 09:12:31'), 0, "고혈압 치료 방법", "고혈압 치료를 하려면 나트륨을 적게 먹어야한다.", null, null, "한라봉");

insert into review values(null, "b", 5305, ('2020-02-24 09:11:22'), 0, "당뇨병 관리 방법", "당뇨병은 식습관 개선과 운동으로 관리해야 한다.", null, null, "한라봉");
insert into review values(null, "b", 5305, ('2020-03-24 09:11:22'), 0, "당뇨병 관리 방법", "당뇨병은 식습관 개선과 운동으로 관리해야 한다.", null, null, "한라봉");
insert into review values(null, "b", 5305, ('2021-02-24 09:11:22'), 0, "당뇨병 관리 방법", "당뇨병은 식습관 개선과 운동으로 관리해야 한다.", null, null, "한라봉");
insert into review values(null, "b", 5305, ('2021-03-09 09:11:22'), 0, "당뇨병 관리 방법", "당뇨병은 식습관 개선과 운동으로 관리해야 한다.", null, null, "한라봉");
insert into review values(null, "b", 5305, ('2021-08-24 09:11:22'), 0, "당뇨병 관리 방법", "당뇨병은 식습관 개선과 운동으로 관리해야 한다.", null, null, "한라봉");

insert into review values(null, "c", 5292, ('2020-03-24 09:12:31'), 0, "비만은 질병이다.", "비만은 식이요법과 운동이 매우 중요하다.", null, null, "한라봉");
insert into review values(null, "c", 5292, ('2020-09-24 09:12:31'), 0, "비만은 질병이다.", "비만은 식이요법과 운동이 매우 중요하다.", null, null, "한라봉");
insert into review values(null, "c", 5292, ('2020-11-24 09:12:31'), 0, "비만은 질병이다.", "비만은 식이요법과 운동이 매우 중요하다.", null, null, "한라봉");
insert into review values(null, "c", 5292, ('2021-03-24 09:12:31'), 0, "비만은 질병이다.", "비만은 식이요법과 운동이 매우 중요하다.", null, null, "한라봉");
insert into review values(null, "c", 5292, ('2021-09-24 09:12:31'), 0, "비만은 질병이다.", "비만은 식이요법과 운동이 매우 중요하다.", null, null, "한라봉");

insert into review values(null, "d", 5215, ('2020-02-24 09:12:31'), 0, "고지혈증 식습관", "섬유소를 많이 먹으면 혈액 내 콜레스테롤수치가 낮아지고 체중 감소에도 도움이 되므로, 가급적 섬유소가 많은 식품을 선택하여 먹는다.", null, null, "한라봉");
insert into review values(null, "d", 5215, ('2020-05-24 09:12:31'), 0, "고지혈증 식습관", "섬유소를 많이 먹으면 혈액 내 콜레스테롤수치가 낮아지고 체중 감소에도 도움이 되므로, 가급적 섬유소가 많은 식품을 선택하여 먹는다.", null, null, "한라봉");
insert into review values(null, "d", 5215, ('2021-08-24 09:12:31'), 0, "고지혈증 식습관", "섬유소를 많이 먹으면 혈액 내 콜레스테롤수치가 낮아지고 체중 감소에도 도움이 되므로, 가급적 섬유소가 많은 식품을 선택하여 먹는다.", null, null, "한라봉");
insert into review values(null, "d", 5215, ('2021-12-01 09:12:31'), 0, "고지혈증 식습관", "섬유소를 많이 먹으면 혈액 내 콜레스테롤수치가 낮아지고 체중 감소에도 도움이 되므로, 가급적 섬유소가 많은 식품을 선택하여 먹는다.", null, null, "한라봉");
insert into review values(null, "d", 5215, ('2021-12-24 09:12:31'), 0, "고지혈증 식습관", "섬유소를 많이 먹으면 혈액 내 콜레스테롤수치가 낮아지고 체중 감소에도 도움이 되므로, 가급적 섬유소가 많은 식품을 선택하여 먹는다.", null, null, "한라봉");

insert into review values(null, "e", 5340, ('2020-02-15 09:12:31'), 0, "동맥경화증 좋은 우엉", "우엉은 그중에서도 동맥경화증상을 줄이는데 커다란 효과를 줄 수 있어 각광을 받고 있습니다.", null, null, "한라봉");
insert into review values(null, "e", 5340, ('2020-03-24 09:12:31'), 0, "동맥경화증 좋은 우엉", "우엉은 그중에서도 동맥경화증상을 줄이는데 커다란 효과를 줄 수 있어 각광을 받고 있습니다.", null, null, "한라봉");
insert into review values(null, "e", 5340, ('2020-04-15 09:12:31'), 0, "동맥경화증 좋은 우엉", "우엉은 그중에서도 동맥경화증상을 줄이는데 커다란 효과를 줄 수 있어 각광을 받고 있습니다.", null, null, "한라봉");
insert into review values(null, "e", 5340, ('2021-04-16 09:12:31'), 0, "동맥경화증 좋은 우엉", "우엉은 그중에서도 동맥경화증상을 줄이는데 커다란 효과를 줄 수 있어 각광을 받고 있습니다.", null, null, "한라봉");
insert into review values(null, "e", 5340, ('2021-04-29 09:12:31'), 0, "동맥경화증 좋은 우엉", "우엉은 그중에서도 동맥경화증상을 줄이는데 커다란 효과를 줄 수 있어 각광을 받고 있습니다.", null, null, "한라봉");

insert into review values(null, "f", 5243, ('2020-02-24 12:5:31'), 0, "급성심근경색 식습관", "콜레스테롤이 많은 식품은 1주일에 3회 이하로 섭취를 제한합니다 (달걀, 생선, 육류의 내장, 새우, 장어 등).", null, null, "한라봉");
insert into review values(null, "f", 5243, ('2020-09-07 12:5:31'), 0, "급성심근경색 식습관", "콜레스테롤이 많은 식품은 1주일에 3회 이하로 섭취를 제한합니다 (달걀, 생선, 육류의 내장, 새우, 장어 등).", null, null, "한라봉");
insert into review values(null, "f", 5243, ('2020-12-29 12:5:31'), 0, "급성심근경색 식습관", "콜레스테롤이 많은 식품은 1주일에 3회 이하로 섭취를 제한합니다 (달걀, 생선, 육류의 내장, 새우, 장어 등).", null, null, "한라봉");
insert into review values(null, "f", 5243, ('2021-02-24 12:5:31'), 0, "급성심근경색 식습관", "콜레스테롤이 많은 식품은 1주일에 3회 이하로 섭취를 제한합니다 (달걀, 생선, 육류의 내장, 새우, 장어 등).", null, null, "한라봉");
insert into review values(null, "f", 5243, ('2022-02-24 12:5:31'), 0, "급성심근경색 식습관", "콜레스테롤이 많은 식품은 1주일에 3회 이하로 섭취를 제한합니다 (달걀, 생선, 육류의 내장, 새우, 장어 등).", null, null, "한라봉");

insert into review values(null, "g", 5495, ('2020-02-24 18:11:22'), 0, "뇌졸증이 아니다 뇌졸중이다.", "뇌졸중은 치료 만큼이나 예방이 중요한 질환인데요. 꾸준한 운동과 함께 금연, 절주 및 식습관을 바꾸는 것이 가장 기본입니다.", null, null, "한라봉");
insert into review values(null, "g", 5495, ('2020-05-08 12:11:22'), 0, "뇌졸증이 아니다 뇌졸중이다.", "뇌졸중은 치료 만큼이나 예방이 중요한 질환인데요. 꾸준한 운동과 함께 금연, 절주 및 식습관을 바꾸는 것이 가장 기본입니다.", null, null, "한라봉");
insert into review values(null, "g", 5495, ('2020-07-01 12:11:22'), 0, "뇌졸증이 아니다 뇌졸중이다.", "뇌졸중은 치료 만큼이나 예방이 중요한 질환인데요. 꾸준한 운동과 함께 금연, 절주 및 식습관을 바꾸는 것이 가장 기본입니다.", null, null, "한라봉");
insert into review values(null, "g", 5495, ('2021-01-24 12:11:22'), 0, "뇌졸증이 아니다 뇌졸중이다.", "뇌졸중은 치료 만큼이나 예방이 중요한 질환인데요. 꾸준한 운동과 함께 금연, 절주 및 식습관을 바꾸는 것이 가장 기본입니다.", null, null, "한라봉");
insert into review values(null, "g", 5495, ('2021-06-24 12:11:22'), 0, "뇌졸증이 아니다 뇌졸중이다.", "뇌졸중은 치료 만큼이나 예방이 중요한 질환인데요. 꾸준한 운동과 함께 금연, 절주 및 식습관을 바꾸는 것이 가장 기본입니다.", null, null, "한라봉");

insert into review values(null, "h", 5833, ('2020-03-12 12:20:31'), 0, "골다공증", "과도한 음주를 삼가하고 흡연은 중단하며 적절한 유산소 운동과 스트레칭, 제자리에서 뛰기 등과 같은 운동을 하여 골량을 유지하여야 한다.", null, null, "한라봉");
insert into review values(null, "h", 5833, ('2020-04-12 12:20:31'), 0, "골다공증", "과도한 음주를 삼가하고 흡연은 중단하며 적절한 유산소 운동과 스트레칭, 제자리에서 뛰기 등과 같은 운동을 하여 골량을 유지하여야 한다.", null, null, "한라봉");
insert into review values(null, "h", 5833, ('2020-05-12 12:20:31'), 0, "골다공증", "과도한 음주를 삼가하고 흡연은 중단하며 적절한 유산소 운동과 스트레칭, 제자리에서 뛰기 등과 같은 운동을 하여 골량을 유지하여야 한다.", null, null, "한라봉");
insert into review values(null, "h", 5833, ('2020-06-12 12:20:31'), 0, "골다공증", "과도한 음주를 삼가하고 흡연은 중단하며 적절한 유산소 운동과 스트레칭, 제자리에서 뛰기 등과 같은 운동을 하여 골량을 유지하여야 한다.", null, null, "한라봉");
insert into review values(null, "h", 5833, ('2020-07-12 12:20:31'), 0, "골다공증", "과도한 음주를 삼가하고 흡연은 중단하며 적절한 유산소 운동과 스트레칭, 제자리에서 뛰기 등과 같은 운동을 하여 골량을 유지하여야 한다.", null, null, "한라봉");

insert into review values(null, "i", 5839, ('2020-05-24 12:30:31'), 0, "폐질환", "금연이 만성 폐쇄성 폐질환을 예방하고 질환의 진행 속도를 감소시키는 가장 효과적인 방법이다.", null, null, "한라봉");
insert into review values(null, "i", 5839, ('2020-06-24 12:30:31'), 0, "폐질환", "금연이 만성 폐쇄성 폐질환을 예방하고 질환의 진행 속도를 감소시키는 가장 효과적인 방법이다.", null, null, "한라봉");
insert into review values(null, "i", 5839, ('2020-07-24 12:30:31'), 0, "폐질환", "금연이 만성 폐쇄성 폐질환을 예방하고 질환의 진행 속도를 감소시키는 가장 효과적인 방법이다.", null, null, "한라봉");
insert into review values(null, "i", 5839, ('2020-08-24 12:30:31'), 0, "폐질환", "금연이 만성 폐쇄성 폐질환을 예방하고 질환의 진행 속도를 감소시키는 가장 효과적인 방법이다.", null, null, "한라봉");
insert into review values(null, "i", 5839, ('2020-09-24 12:30:31'), 0, "폐질환", "금연이 만성 폐쇄성 폐질환을 예방하고 질환의 진행 속도를 감소시키는 가장 효과적인 방법이다.", null, null, "한라봉");

insert into review values(null, "j", 5288, ('2020-01-15 12:20:31'), 0, "위장병", "음식 본연의 맛을 느끼며 느긋하게 먹어라.", null, null, "한라봉");
insert into review values(null, "j", 5288, ('2020-02-15 12:20:31'), 0, "위장병", "음식 본연의 맛을 느끼며 느긋하게 먹어라.", null, null, "한라봉");
insert into review values(null, "j", 5288, ('2020-03-15 12:20:31'), 0, "위장병", "음식 본연의 맛을 느끼며 느긋하게 먹어라.", null, null, "한라봉");
insert into review values(null, "j", 5288, ('2020-04-15 12:20:31'), 0, "위장병", "음식 본연의 맛을 느끼며 느긋하게 먹어라.", null, null, "한라봉");
insert into review values(null, "j", 5288, ('2020-05-15 12:20:31'), 0, "위장병", "음식 본연의 맛을 느끼며 느긋하게 먹어라.", null, null, "한라봉");

insert into review values(null, "k", 1988, ('2021-04-16 12:20:31'), 0, "관절염", "건강한 식단을 지키면서 몸을 자주 움직이면 충분히 관절염을 예방할 수 있다.", null, null, "한라봉");
insert into review values(null, "k", 1988, ('2021-05-16 12:20:31'), 0, "관절염", "건강한 식단을 지키면서 몸을 자주 움직이면 충분히 관절염을 예방할 수 있다.", null, null, "한라봉");
insert into review values(null, "k", 1988, ('2021-06-16 12:20:31'), 0, "관절염", "건강한 식단을 지키면서 몸을 자주 움직이면 충분히 관절염을 예방할 수 있다.", null, null, "한라봉");
insert into review values(null, "k", 1988, ('2021-07-16 12:20:31'), 0, "관절염", "건강한 식단을 지키면서 몸을 자주 움직이면 충분히 관절염을 예방할 수 있다.", null, null, "한라봉");
insert into review values(null, "k", 1988, ('2021-08-16 12:20:31'), 0, "관절염", "건강한 식단을 지키면서 몸을 자주 움직이면 충분히 관절염을 예방할 수 있다.", null, null, "한라봉");