select * from food;

/*OpenAPI에 있는 식재료*/
insert into food values(172, '한라봉', '172.png', null, null);

insert into food values(174, '레몬', '174.png', null, null);

insert into food values(39, '블루베리', '39.png', null, null);

insert into food values(178, '당근', '178.png', null, null);

insert into food values(20, '토마토', '20.png', null, null);

insert into food values(179, '브로콜리', '179.png', null, null);

insert into food values(8, '시금치', '8.png', null, null);

insert into food values(76, '땅콩', '76.png', null, null);

insert into food values(130, '양파', '130.png', null, null);

insert into food values(127, '오이', '127.png', null, null);

insert into food values(88, '호두', '88.png', null, null);

insert into food values(72, '귀리', '72.png', null, null);

insert into food values(90, '표고버섯', '90.png', null, null);

insert into food values(67, '새송이버섯', '67.png', null, null);

insert into food values(132, '애호박', '132.png', null, null);

insert into food values(91, '포도', '91.png', null, null);

insert into food values(120, '고구마', '120.png', null, null);

insert into food values(137, '도라지', '137.png', null, null);

insert into food values(153, '양배추', '153.png', null, null);

insert into food values(126, '옥수수', '126.png', null, null);

insert into food values(87, '홍고추', '87.PNG', null, null);

insert into food values(77, '사과', '77.PNG', null, null);

insert into food values(46, '강황', '46.PNG', null, null);

insert into food values(140, '가지', '140.PNG', null, null);

insert into food values(70, '양송이버섯', '70.PNG', null, null);

insert into food values(65, '상황버섯', '65.PNG', null, null);

insert into food values(118, '단호박', '118.PNG', null, null);

insert into food values(139, '감자', '139.PNG', null, null);

insert into food values(109, '배', '109.PNG', null, null);

insert into food values(75, '생강', '75.PNG', null, null);

insert into food values(58, '마늘', '58.PNG', null, null);

insert into food values(170, '딸기', '170.png', null, null);

/*OpenAPI에 없는 식재료*/

insert into food values(200, '자몽', '200.png', '자몽은 서인도제도의 바베이도스가 원산지인 과일로 그레이프프루트가 표준어 입니다.', '자몽에 함유되어 있는 성분중 이노시톨 성분은 항 지방간 비타민 이라고도 불리우는데 지방의 흐름을 원활하게 하여 간에 지방이 쌓이는것을 막아주어 간 기능을 높여 줍니다. 
자몽에 풍부한 엽산은 혈액이나 세포를 만드는 기능을 합니다. 또 태아의 뇌와 척수등을 형성하는데 도움이 되는 성분이라고 합니다. 
따라서 임산부에 매우 도움이 되는 과일이라고 하며 미국에서는 임산부에게 자몽을 적극 추천한다고 합니다.
자몽 반개로 시금치 3 다발 분의 엽산을 섭취 할 수 있다고 합니다. 
수용성 식이섬유인 펙틴이 풍부하게 함유되어 있으며 펙틴은 혈중 콜레스테롤 수치를 낮추는 효과가 있다고 합니다.
자몽에 함유되어 있는 성분중 이노시톨 성분은 항 지방간 비타민 이라고도 불리우는데 지방의 흐름을 원활하게 하여 간에 지방이 쌓이는것을 막아주어 간 기능을 높여 줍니다. 
자몽에 풍부한 엽산은 혈액이나 세포를 만드는 기능을 합니다. 또 태아의 뇌와 척수등을 형성하는데 도움이 되는 성분이라고 합니다.
따라서 임산부에 매우 도움이 되는 과일이라고 하며 미국에서는 임산부에게 자몽을 적극 추천한다고 합니다.
자몽 반개로 시금치 3 다발 분의 엽산을 섭취 할 수 있다고 합니다. 수용성 식이섬유인 펙틴이 풍부하게 함유되어 있으며 펙틴은 혈중 콜레스테롤 수치를 낮추는 효과가 있다고 합니다.
자몽 과육의 붉은색소인 라이코펜과 풍부한 비타민 으로 인해 항산화효과가 뛰어나다고 합니다.
자몽에는 자외선으로 부터 피부를 보호하고 세포가 죽는것을 예방하는 바이오플라보노이드 성분도 함유 하고 있어서 항산화 효과 뿐만 아니라 피부미용에도 도움이 된다고 합니다.
자몽의 풍부한 비타민C는 콜라겐 생성을 촉진시켜 피부 재생을 원활하게 하며 피부 트러블과 피부 노화 등을 예방해 탱탱한 피부를 유지할 수 있도록 도와줍니다.
인슐린 분비를 억제해주는 효과가 있어서 당뇨개선에 도움이 된다고 합니다.
자몽에 풍부한 칼륨이 심장이나 근육의 정상적인 수축을 돕고 당대사를 촉진하는 기능이 있습니다.
또 자몽에 풍부하게 함유되어 있는 비타민C는 혈관을 강하게 만들어주는 효과가 있어서 심장건강에 도움이 된다고 합니다.
자몽의 쓴맛을 내는 성분인 리모닌 성분은 암 예방효과가 있는것으로 알려져 있습니다.
리모닌을 지속적으로 섭취하게 되면 체내의 해독 대사 효소를 활성화 하며 체내의 발암 물질을 배출하는 효과가 있어 암 예방에 도움이 된다고 합니다.
리코펜 성분이 많이 함유되어 있는데요.
리코펜은 카로틴의 일종으로, 카로틴을 섭취하게 되면 체내에서 비타민A로 바뀌게 된다고 합니다.
비타민A는 피부나 눈의 점막을 강화하는 기능이 있어 눈건강에 도움을 기대할 수 있습니다.
콜레스테롤을 낮춰주는 고지혈 치료제와 자몽을 함께 섭취하면 그 효과를 지나치게 높여 부작용을 일으킬 수 있습니다.');

insert into food values(201, '달걀', '201.png','달걀(계란)은 영양 덩어리입니다.
계란 흰자의 영양 성분은 주로 단백질이며, 계란 노른자는 단백질 외에 레시틴, 비타민 A·B2·D·E, 철분, 칼슘 등이 풍부하게 포함되어 있습니다.
또한 계란의 지방은 체내에서 잘 분해되기 때문에 소화 흡수가 잘되며, 계란의 단백질은 다른 단백질의 흡수율을 높이는 성질이 있습니다.
단백질을 구성하는 20여 종류의 아미노산 중 우리 몸에 필수적인 8 종류의 아미노산을 필수 아미노산이라고 합니다.
이 8종의 필수 아미노산이 달걀에는 균형있게 포함되어 있습니다.' , '숙면에 도움, 달걀같은 고단백질 음식은 잠을 부추기고 위산역류를 달래줍니다.
아침 공복에 식사대용으로 달걀을 섭취하면, 하루동안 섭취하는 칼로리를 줄여주는 효과가 있다고 한다.
달걀 노른자에는 비타민B군의 하나로 피부,손발톱,머리카락을 매끄럽게 만들고 신경계/골수의 기능을 원활하게 해주는 "비오틴"성분이 함유되어 있습니다.
그러나 공교롭게도 달걀의 흰자에 "아비딘"이라는 성분이 흰자에 함유되어 있어 "비오틴"성분의 체내흡수를 방해합니다.
그러므로 되도록이면 달걀의 흰자는 완숙으로 완적히 익혀드시는 것이 좋습니다.');

insert into food values(202, '아몬드', '202.png', '아몬드에는 다량의 단일불포화지방산과 단백질이 풍부하게 들어 있습니다.', '항산화 성분이 풍부합니다.
항산화 성분은 우리 몸에서 활성산소가 일으키는 세포 변종과 세포 노화에 대응하고 각종 질병을 억제합니다.
이 성분은 주로 아몬드의 갈색 껍질에 들어 있어서, 껍질을 벗긴 아몬드에서는 이 효능을 기대할 수 없습니다.
특히 항산화제로 작용하는 비타민E는 아몬드 100g에 25.63mg이 들어 있어서, 비타민E의 가장 풍부한 공급원 중 하나입니다.

섬유질이 풍부합니다.
아몬드 100g에 12.5g의 섬유질이 들어 있습니다.
섬유질은 탄수화물의 흡수를 느리게 해서 혈당 조절을 돕고, 또한 소화를 돕습니다.

미네랄이 풍부합니다.
모든 생물에 필수 미네랄인 마그네슘이 풍부하게 들어 있고, 뼈 건강에 중요한 인과, 면역 기능과 소화기능 등에 작용하는 망간도 풍부하게 들어 있으며, 헤모글로빈의 성분인 철분도 풍부하게 들어 있습니다.
우리 몸에 이로운 많은 영양소가 갈색 속껍질에 들어 있으므로 구매할때 되도록이면 갈색 속껍질이 있는 아몬드를 선택하세요.

냄새를 맡아서 기름 냄새가 난다면 너무 오래돼서 산패한 것이므로 피해야 합니다.
밀폐 용기에 담아 서늘하고 건조한 곳에 보관.');

insert into food values(203, '검은콩', '203.png', '낟알 껍질의 빛깔이 검은빛을 띄는 콩으로 흑태, 서목태(쥐눈이콩), 서리태 등이 있다.', '흑태는 콩밥, 콩자반 등으로
서리태는 콩밥, 콩떡 등으로
서목태는 한방에서 약콩으로 주로 쓰인다.

일반콩에 비해
콜레스테롤 수치를 낮춰주는 기능이 높고 안토시아닌이 풍부해 강력한 항산화작용을 한다고 한다.

[부작용]
- 과다섭취시 여성호르몬이 과잉분비될 수 있다.
- 소화가 잘 되지 않으므로 소화력이 약한사람은 부드럽게 익혀먹어야 한다.
- 적당량의 섭취는 신장기능을 활성화 시키지만, 이미 신장이 좋지않은 사람은 주의해야 한다.');

insert into food values(204, '치즈', '204.png', '치즈 또는 건락은 우유, 산양유, 양젖 또는 그 밖의 파충류의 젖으로 만든 고체 음식이다.
칼슘, 단백질, 지방 등의 영양성분이 풍부하게 들어있다.', '스트레스 해소.
시력보호, 빈혈예방, 피로회복.
당뇨병 예방.
숙면에 도움, 고단백질 음식은 잠을 부추기고 위산역류도 달래준다.
치즈에는 염분과 지방의 함량이 높기 때문에 염분 섭취를 제한해야 하는 사람,
비만 또는 다이어트를 하고 있을때에는 치즈를 제한 하는 것이 바람직합니다.');

insert into food values(205, '아보카도', '205.png', '아보카도는 멕시코가 원산지로 악어의 등처럼 울퉁불퉁하다고 해서 악어배라고 불립니다.', 
'혈관벽을 튼튼하게 하고 혈액을 흐름 개선.
아보카도에 포함되어 있는 식물 영양소 중에서 항산화 작용이 있는 카로티노이드 성분은 체내의 혈관벽을 튼튼하게 해주는 효과가 있습니다.
그리고 높은 비율의 불포화 지방산은 혈액 흐름을 개선시켜 주는 효과가 있어서 저혈압과 고혈압 환자에게 모두 좋은 효과를 기대할 수 있습니다.
좋은 콜레스테롤 증가.
아보카도 속의 불포화 지방산 성분인 올레산과 팔미트산등은 좋은 콜레스테롤을 증가 시켜 건강한 혈액을 만들고 관상동맥 질환에 도움을 줍니다.
변비와 혈중 콜레스테롤 수치를 개선.
아보카도 100g 속에는 하루 필요 섭취량의 18%에 해당하는 풍부한 식이섬유가 들어있어서 변비와 혈중 콜레스테롤 수치를 낮추는데 도움을 줍니다.
항산화 작용과 면역력 개선.
아보카도의 폴리페놀(루테인, 제산악틴, 베타·알파카로틴)과 플로보노이드 화합물은 항염증·항궤양 작용은 물론, 노화와 각종 질병을 일으키는 활성산소를 억제하는데 도움을 줍니다.
용에 효과.
아보카도에는 비타빈A·E·K 그리고 철·구리·마그네슘 등 풍부한 미네랄의 보고입니다.
특히 토코페롤이라고 불리는 비타민E성분은 노화를 방지하는 효과가 기대되는 성분입니다.
[부작용/주의사항]
아보카도에는 심혈관 질환에 좋은 불포화 지방산이 많이 들어있지만 불포화 지방산도 역시 지방이기 때문에 칼로리를 많이 낼 수 밖에 없습니다.
그러므로 다이어트 등 체중 조절이 필요한 사람들은 과잉 섭취 않도록 주의해야 합니다. 그리고 탄닌 성분이 많아 탄닌에 의한 특정 미네랄 성분의 채내 흡수를 억제 시킬 수 있습니다.
꽃가루에 알레르기를 일으키는 사람은 먹고난 후에 입이나 인후부에 알레르기 증상이 나타나고,
라텍스에 알레르기를 일으키는 사람들은 전신의 두드러기, 복통, 구토를 일으키고 때로는 그 반응이 심각해서 생명을 위협할 수도 있다고 합니다.');

insert into food values(206, '계피', '206.png', '동의보감에 의하면
속을 따뜻하게 하고 혈맥을 잘 통하게 하고 간이나 폐의 기를 고르게 한다고 한다.', '자양강장.
해열, 진통 효과.
항균, 살충효과.
충치예방.
곰팡이 없애는 효과.
몸에 열이 많은사람은 주의하는게 좋다.');

insert into food values(213, '올리브유', '213.png', '올리브유(올리브오일)는 식물성 기름중에서 단일불포화지방산을 가장 많이 함유하고 있어 먹는 기름중에선 건강에 가장 좋습니다.', '불포화지방산, 비타민E, 토코페롤이 풍부하여 노화를 방지합니다.
올리브유는 천연 간해독제로써, 올리브유를 섭취함으로써 간의 담즙 분비를 촉진하는 작용으로,
체내의 독소배출에 이로운 작용을 돕고 담즙생성을 도와 독소를 배출시키고 혈액을 맑게 해줍니다.
엑스트라 버진 올리브유에 포함된 폴리페놀, 토코페롤, 올레익산이 심장병의 염증을 낮추고, 혈관의 포화지방을 낮추고 심장병 예방에 특히 좋다고 알려졌습니다.
체내의 콜레스테롤 수치를 낮추고, 인스턴트, 가공식, 패스트푸드, 고기류 섭취로 얻어진 포화지방을 낮춰주는 역할을 합니다.
혈액의 응고를 막아주고 인체의 유익한 HDL 콜레스테롤을 높여주어 혈관을 튼튼하게 해주고 고혈압 예방과 개선에 좋습니다.
대두유나 옥수수유의 경우 GMO(유전자 조작) 식품이 많은데 올리브유는 천연 과일을 압착한 안전한 기름입니다.');

insert into food values(214, '식초', '214.png', '식초는 예부터 중요한 조미료로 사용되었다. 제조법에 따라 합성식초와 양조식초로 나뉩니다.
합성식초(빙초산)은 화학적인 방법으로 만들어진 것으로 한때 우리나라 대중음식점 등에서 냉면이나 음식물에 쳐서 먹는 초로 사용됐습니다. 그러나 합성식초에 포함된 화학 물질이 몸에 악영향을 미치는 것이 알려지면서 선진국에서는 빙초산을 독극물로 분류하고 있습니다.
건강에 관련해 언급되는 식초는 천연 발효된 양조식초를 말합니다. 시중에 나와 있는 양조식초는 쌀식초, 현미식초, 곡물식초, 맥아식초, 사과식초, 포도식초, 레드와인식초, 감식초, 발사믹식초, 허브식초 등 다양합니다.', '식초는 초산 · 구연산 · 아미노산 · 호박산 등 60여 종 이상의 유기산을 포함하고 있으며, 비타민과 무기질 등 각종 영양소의 체내 흡수를 도와주는 촉진제 역할을 합니다. 또한 많은 아미노산이 들어 있으며, 그 가운데 일부는 비만을 방지하고 콜레스테롤을 저하시켜 지방간을 막는 작용을 합니다.
양조식초에 함유된 초산 등의 유기산은 식욕을 증진시킵니다. 식초는 체내의 잉여 영양소를 분해하며 담즙이나 부신피질호르몬의 생성을 돕고, 피로를 유발하는 물질인 유산(젖산)의 생성을 막을 뿐 아니라 이미 생성된 유산은 분해한다. 생선회 등 날 음식을 먹을 때 식초를 사용하는 것은 살균 작용이 있기 때문입니다. 
또한 식초는 비만 예방, 간 기능 강화, 성장 촉진, 당 대사 촉진, 면역력 증강, 피로 회복 및 생활에 활력을 줍니다.  
특히 식초는 산소와 헤모글로빈의 친화력을 높여 뇌에 충분한 산소를 공급하여 머리를 맑게 해주고 기억력을 증진시킵니다. 특히 파로틴(일명 회춘 호르몬)의 분비를 촉진하여 세포의 노화를 막고 뼈를 강하게 하고, 체내의 칼슘 흡착력을 높여서 골의 질량을 늘립니다. 
아울러 타액과 위액의 분비를 촉진하여 식욕을 증진시키고 소화 흡수를 도우며 갈증을 없앱니다. 정장 작용을 통하여 배가 더부룩하고 꾸르륵거릴 때, 대변이 묽거나 설사 등의 개선에도 도움이 됩니다.
');

insert into food values(215, '두유', '215.png', '두유는 고려시대까지는 두즙이라고 표기되었으며, 조선시대에 이르러 두유(豆乳)라고 쓰이기 시작해 오늘에 이르렀습니다.', '두유에는 소화흡수가 용이한 단백질뿐 아니라 성장에 도움을 주는 리신, 트립토판과 맛을 내는 글루타민산과 영양소 대사에 도움이 되는 아스파라긴산, 충치를 예방하는 글리신이 골고루 들어 있습니다. 
불포화지방산인 두유의 지방에는 콜레스테롤이 함유되어 있지 않고, 오히려 불포화지방산이 혈관벽 내에 침착하는 LDL콜레스테롤을 녹여서 운반, 제거하는 작용을 합니다.
또한 레시틴이라는 인지질이 함유되어 있어 여분의 콜레스테롤이나 지방을 녹여내는데, 이 성분은 피부가 거칠어지는 것을 막아주고, 노화를 예방하는 효과를 냅니다. 두유는 알카리성 식품으로 칼륨과 인이 80%를 차지합니다. 이외에도 철, 니켈, 마그네슘, 아연, 바나듐, 동 등의 미네랄이 함유되어 있습니다.
따라서 두유는 육류 섭취의 증가로 산성화된 현대인들의 체질을 중화시켜 신체의 균형을 유지하는데 도움이 됩니다. 또한 두유는 우유 단백질을 소화시키지 못하거나 알레르기가 있는 유아의 영양 공급원으로 대용되기도 하는데, 이유식을 시작할 때부터 먹이도록 합니다.');

insert into food values(216, '두부', '216.png', '두부를 만드는 과정에서 콩물이 응고된 상태에서 수분을 제거하지 않은 두부를 순두부라 하고,
일반 두부와 순두부의 중간 굳기로 팩에 콩즙과 응고제를 넣고 가열해 굳힌것이 연두부 입니다.', '두부에는 이소플라본이라는 성분이 들어 있어 발암물질의 생성을 억제시키고 강력한 항산화작용을 하여
암세포가 사멸하도록 만들어 각종 암을 효율적으로 예방해주는 항암효과가 있습니다.
여성호르몬인 에스트로겐과 비슷한 효능을 가지고 있어서 갱년기 여성분들의 여성호르몬 부족으로 인해 발생할 수 있는 안면홍조나 우울증, 골다공증, 심혈관질환을 개선하는데 효과를 볼수있습니다.
고단백 저칼로리 식품으로 체내에 지방이 쌓이는 것을 막아주고 체지방을 분해시키는 효능을 가지고 있어 다이어트에 좋을 뿐만아니라, 근육만들기와 같은 몸매 가꾸기에도 도움이 됩니다.
풍부한 올리고당이 장의 연동운동을 활성화시켜 주기때문에 소화흡수를 개선시켜 변비가 있다거나 소화가 안 될 때에도 좋습니다.
두부에 함유된 리놀산 성분이 콜레스테롤의 수치를 낮추는 효능을 가지고 있어 동맥경화를 예방하는데 도움이 되며, 피토스테롤이라는 성분이 심장병 예방에 도움이 됩니다.');

insert into food values(217, '바나나', '217.png', '바나나는 파초과(musaceae), 바나나 속(musa, spp) 에 속하는 숙근성 영년생 열대과수로 열대 및 아열대 지역에서 자라며, 지금도 말레이시아와 인도네시아 산림지역에서 야생종 바나나를 찾아 볼 수 있어 이 지역이 원산지로 추정됩니다.
', '익은 바나나 과육은 약 70%가 수분이고 나머지 주성분은 탄수화물 27.1%, 단백질 1.2%, 지방 0.3%, 섬유소 0.5%, 회분 0.9%이며 칼로리는 과육 100g당 87kcal 정도입니다. 탄수화물은 전분형태로 저장되어 익는 과정에서 프락토즈, 글루코스, 당 등으로 전환되는데 장거리 수송이나 수출을 위한 덜익은 녹색 바나나는 가용성 고형물이 0.1~2.0%, 총 전분량이 19.5~21.5%이나 잘 익은 바나나는 총 당이 18.5~19.0%, 전분은 1.0~1.5%입니다. 바나나는 비타민 a가 풍부하며 c도 상당량 함유되어 있으나 b는 적은 편입니다.
바나나는 주로 생식 또는 요리하여 식용 하는데 익은 상태의 바나나는 당이 많으며 소화가 잘 된다. 아프리카의 적도 부근, 킬리만자로에서 대서양에 이르는 지역, 동남 아시아 태평양 도서지방 에서는 주식으로 이용하기도 하나 대부분 디저트 용으로 많이 소비합니다. 아프리카에서는 바나나로 양조 또는 맥주를 만드는데 알콜함량은 낮으나 비타민이 풍부하여 영양원 으로서 중요한 위치를 차지 하며 그 밖에 익은 바나나를 절편 내에 말린 피그, 바나나 제분가두, 바나나 칩, 잼, 쥬스, 과자, 캐찹, 식초 등이 있으며 열대지역에서는 바나나 잎을 반추동물의 사료로도 이용합니다.
소화가 여려운 식품대신 어린이나 노약자에게 주식으로 이용할 수도 있으나 바나나에는 혈압을 상승시키는 셀로토닌이라는 성분이 들어 있어 지나칠 정도로 많이 식용하면 좋지 않습니다. 
그외 아프리카 일부 지역 에서는 바나나 웅화를 채소로 이용 하기도 하며 저개발국가에서는 바나나 푸른 잎을 우산이나 랩으로 사용하기도 한다. 줄기에서 뽑은 섬유는 마닐라 삼보다 질기지는 않으나 로프, 가방을 만들기도 합니다.');

insert into food values(218, '멸치', '218.png', '멸치는 남녀노소에게 칼슘을 제공하는 칼슘의 제왕입니다. 어린이 성장과 발육에 갱년기 여성의 골다공증 예방, 태아의 뼈 형성을 돕습니다. 트래킹 후 햇볕에 그을린 피부와 피곤해진 근육에 멸치는 자양강장제입니다.', '멸치는 칼로리가 다른 어종이나 육류에 비해 월등히 높으며 특히 살과 뼈를 전부 먹을 수 있어 뼈와 치아 형성에 절대적으로 필요한 칼슘과 인의 섭취에 매우 좋은 식품입니다. 
타우린을 많이 함유하고 있어 콜레스테롤의 함량을 낮추며, 혈압을 정상적으로 유지하고 심장도 튼튼하게 하며 심장병, 뇌졸중의 원인인 동맥경화를 방지하고 어린이의 지능 발달에도 효과가 있는 고도불포화지방산인 EPA와 DHA가 각각 9.2%, 14.1%나 들어 있습니다. 또한 항암작용이 있는 니아신이 들어 있고 핵산의 함량도 풍부해 영양적으로 균형이 잡힌 우수한 식품입니다.');

insert into food values(219, '케일', '219.png', '케일은 남유럽 원산지로 항산화제 성분이 많은 식물인 브로콜리, 양배추, 유채, 청경채와 같은 십자화과 식물입니다.', '풍부한 엽록소(클로로필)는 체내 유전자를 회복 시켜 암을 예방하는데 도움을 줍니다.
위염·위궤양에 좋다는 비타민U 성분을 함유하고 있습니다.
비타민M(엽산)을 다량 함유하고 있습니다.
항암에 효과적이라는 베타카로틴이 녹황색 채소 중에서 가장 많이 들어있습니다.
비타민A(시력보호작용)의 경우에는 100g당 하루 권장 섭취량의 134%가 들어있습니다.
뇌신경에 작용하는 GABA성분도 들어 있습니다.
케일의 풍부한 식이섬유는 장내 변의 양을 늘리고 부드럽게 해 변비를 해소하는데 탁월한 효능이 있습니다.
또한 케일의 식이섬유는 여분의 콜레스테롤을 몸 밖으로 배출하게 쉽게 해 혈액을 청소합니다.
케일에 들어있는 항산화 성분인 베타카로틴, 루테인 성분 등은 체내 활성 산소와 결합해 세포 조직의 산화를 막고 암 발생을 예방합니다.
케일에 다량 함유된 멜라토닌 성분은 숙면을 취하게 하고, 노화 억제와 체내 독소를 배출하는데 도움을 줍니다.');

insert into food values(221, '삼치', '221.png', '고등어과 어류의 일종인 삼치는 예로부터 우리나라의 중요한 수산자원으로 일반인들에게도 익숙한 생선입니다. 
우리나라 해역에는 삼치의 아종이 몇 종류 있는데, 겉모습이 확연하게 차이가 나지 않는 두 종류 즉, 삼치와 평삼치를 구분하지 않고 삼치라고 부릅니다.', '삼치는 주로 구이로 먹는데, 구이도 좋지만 냄비를 이용해서 조림이나 찜을 해먹는 방법도 좋습니다. 삼치에 들어 있는 뇌에 좋은 영양소들을 잘 섭취하려면 지방성분을 잃지 않는 조리법이 좋은데, 조림이나 찜을 해 먹으면 삼치의 영양소를 아주 알뜰하게 챙겨 먹을 수 있습니다.
고혈압 예방, 성장기 어린이 두뇌발달 (단백질을 비롯한 각종 영양소가 풍부하다. 혈압을 내리는 효과가 있는 칼륨도 많이 함유하고 있어 고혈압 예방에 좋습니다. 또한 DHA 라는 오메가 3 지방산이 100g당 1,288mg 수준으로 많이 들어 있어 성장기 어린이의 두뇌발달에 효과적입니다.)
');

insert into food values(207, '녹차', '207.JPG', '원산지가 중국으로 알려지고 있는 차(茶)나무는 후피향(厚皮香) 나무과에 속하는 상록활엽관목입니다. 잎은 차로, 열매는 착유해서 기름으로, 줄기는 단추감으로 이용됩니다.',
'인슐린 분비를 돕고 혈당 수치를 낮추는 효능이 있습니다.
우리 몸에 나쁜 LDL 콜레스테롤 수치를 낮추고, 좋은 HDL 콜레스테롤 수치를 높여 뇌졸중이나 심근경색의 위험을 줄일 수 있습니다.
혈압을 안정시켜 심혈관 질환에 큰 도움이 됩니다.
노화로 인한 뇌질환에 대응하는 효능이 있습니다.
녹차에 풍부하게 들어 있는 폴리페놀 성분에 노화로 인한 세포 손상에 대응하는 효능이 있습니다.
풍부한 카테킨 성분이 간의 염증을 대응해서 간 기능을 돕습니다.
녹차의 카테킨은 박테리아에 대응하는 효능이 있어 충치 예방에 좋습니다.
또한 카테킨 성분은 지방 연소를 촉진하며 신진대사율을 높이는 효능이 있습니다.');

insert into food values(208, '현미', '208.JPG', '수확한 벼를 건조, 탈곡한 후 벼의 겉층인 벼껍질만을 벗긴 쌀을 의미합니다.',
'인슐린 분비가 급격하게 상승하는 것을 막아줍니다.
당분의 흡수를 지연시켜주어 당뇨병 완화 또는 예방이 가능합니다.
체내에 쌓여있는 중금속을 밖으로 배출 시켜주는 효능이 있습니다.
콜레스테롤과 지방을 체내에서 배출시켜주어 대장암 예방이 가능합니다.');

insert into food values(209, '시리얼', '209.JPG', '시리얼은 천연 곡물 그대로의 맛과 향을 살리기 위해 구워서 만들어집니다. 곡물을 수확한 후 찌기, 압착하여 바삭하게 굽기, 다양한 비타민과 무기질을 첨가 후 코팅하고 건조합니다. 소화도 잘되고 우유와 곁들여 먹을 때 기름띠도 생기지 않습니다.',
'곡물 시리얼은 식이섬유가 많아 장 운동을 활발히 하여 배변활동을 하는데 도움을 주는 역할을 합니다. 섬유질이 풍부하기 때문에 변비를 예방하고 소화에 도움을 줍니다.
식이섬유가 풍부하여 포만감을 오래 유지시켜 불필요한 섭취를 줄일 수 있고 칼로리가 높지 않기 때문에 체중 유지에 도움을 줍니다.
단백질과 탄수화물이 육체적 활동을 위해 필요한 근육을 확보하여 운동 수행능력을 향상해주며, 단백질과 탄수화물을 함께 섭취하여 근육을 생성하는데 도움을 줍니다.');

insert into food values(210, '다시마', '210.JPG', '암갈색을 띠고 뿌리, 줄기, 잎 3부분으로 된 대형의 다년생 해조류입니다. 겉으로 볼 때 줄기, 잎, 뿌리가 구분이 뚜렷합니다.',
'라마닌 성분은 혈압을 낯춰 주는 데 효과가 있습니다.
아이오딘, 칼륨, 칼슘과 같은 성분도 많이 있으므로 우리 몸에 필요한 무기염류를 섭취할 수 있습니다.
칼슘과 마그네슘 성분이 뼈 강화에 도움이 됩니다.
섬유질이 장 기능을 개선하고 비만을 억제합니다.
식이섬유가 독소 배출과 간 기능 강화에 도움이 됩니다.');

insert into food values(211, '우유', '211.JPG', '물 87%, 지방 4%, 단백질 3.5%, 락토스(젖당) 5%, 미네랄 0.7% 정도로 구성되어 있습니다.',
'우유 속의 유당, 비타민 D, 구연산 등은 칼슘의 흡수를 촉진합니다.
칼슘과 인은 골격과 치아를 구성하고 유지하는데 중요한 성분으로 우유를 충분히 섭취하면 칼슘과 인의 비율을 권장량에 맞게 1:1 수준으로 충족시킬 수 있습니다.
노령화에 따른 뼈의 손실과 골다공증 예방에 도움이 됩니다.
인체에 필요한 칼륨, 마그네슘, 나트륨 등이 다량 함유되어 있고 구리, 철분, 아연 이외에도 10여종 이상의 미량원소들이 함유되어 있어 인체의 대사작용에 중요한 역할을 합니다.');

insert into food values(212, '요거트', '212.JPG', '우유에 균을 발효시켜 만든 유제품으로 우유 속 단백질, 칼슘, 비타민 등의 영양소가 풍부하며, 몸에 유익한 유산균이 모두 들어있습니다.',
'면역력을 높여 전반적인 건강을 돕습니다.
뼈 건강을 증진시키고 당뇨 예방에 도움이 됩니다.
설사 등 소화와 관련한 증상을 완화해 정상적인 배변이 되게 합니다.
혈중 콜레스테롤 수치와 혈압을 낮추고 혈류를 개선해 심혈관 건강에 도움이 됩니다.
항염 및 소염 작용이 있어서 염증으로 인한 증상 완화에 도움을 줍니다.
피부 세포 건강에 도움을 줍니다.
우울증 증상을 완화하는 등 정신 건강에 도움을 줍니다.');

insert into food values(220, '고등어', '220.PNG', '‘국민생선’, ‘바다의 보리’로 불리는 생선으로, 단백질과 지질이 풍부한 고열량 식품이며, 구이와 조림 등 다양한 요리 재료로 널리 사랑받고 있습니다.',
'오메가 3 지방산이 콜레스테롤을 낮추고 관절염을 예방합니다.
고등어에 함유된 DHA는 뇌세포 활성화 물질로 뇌 활동을 촉진해 치매 예방에 효과가 있으며, 성장기 어린이들의 신경조직과 함께 두뇌발달에 도움을 줍니다.
고도의 불포화지방산인 EPA가 어류 중에서 가장 많아 동맥경화, 혈전증, 고혈압, 심장질환 등의 성인병 예방에 유익한 식품이며 혈관 확장, 혈소판 응고 억제, 혈압강하, 콜레스테롤 저하 작용에 효능이 있습니다.
오메가3의 지방산인 DHA와 EPA는 암 예방에도 도움이 됩니다.
고등어에는 철분과 비타민B 성분도 풍부하게 들어 있어 빈혈과 피부미용에 효과가 있으며, 단백질이 풍부해 근육량 증가에 도움이 됩니다.');

insert into food values(222, '갈치', '222.JPG', '칼처럼 생긴 물고기라는 데서 유래, 갈치의 몸은 두께가 얇고 납작하며 살은 연하고 담백해서 구이와 찌개, 국 등 다양한 요리에 사용됩니다.',
'필수 아미노산, 무기질, 비타민 - 오장의 기운을 돋우고 위장을 따뜻하게 해주어 소화가 잘되게 해줄뿐 아니라 식욕증진에 좋습니다.
갈치는 리진, 페닐알라닌, 메티오닌 등 필수아미노산이 고루 함유된 단백질 공급식품으로 특히 라이신 함량이 높아 성장기 어린이의 발육에 좋습니다.
단백질 함량이 많고, 지방이 적당량 들어 있어 과잉 섭취만 하지 않은 경우 다이어트 식사에 활용하면 도움이 됩니다.
칼슘과 나트륨 등이 풍부 해 골다공증 예방에도 좋고 불포화 지방산이 많아 두뇌 발달에도 도움이 됩니다. 
비타민A가 많아 눈 건강에 도움이 됩니다.');

-- food 테이블의 한 줄을 지우고 싶을 때 
DELETE FROM food WHERE num = 172;

-- food 테이블 insert한거 몽땅 없애고 싶을 때 
set FOREIGN_KEY_CHECKS = 0;
truncate food;
set FOREIGN_KEY_CHECKS = 1;